# Формат выходных данных
# Выведите таблицу стоимости. Цены вывести с точностью до двух знаков

# пример:
# Входные данные
# 9.99
# Выходные данные
# 1 9.99 Rub.
# 2 19.98 Rub.
# 3 29.97 Rub.
# 4 39.96 Rub.
# 5 49.95 Rub.
# 6 59.94 Rub.
# 7 69.93 Rub.
# 8 79.92 Rub.
# 9 89.91 Rub.
# 10 99.9 Rub.
# 11 109.89 Rub.
# 12 119.88 Rub.
# 13 129.87 Rub.
# 14 139.86 Rub.
# 15 149.85 Rub.
# 16 159.84 Rub.
# 17 169.83 Rub.
# 18 179.82 Rub.
# 19 189.81 Rub.
# 20 199.8 Rub.

# TODO: your code here

a = float(input("Введите стоимость единицы товара: "))

print(
'1 ',a*1, 'Rub.',
'2 ',a*2 ,'Rub.',
'3 ',a*3 ,'Rub.',
'4 ',a*4 ,'Rub.',
'5 ',a*5 ,'Rub.',
'6 ',a*6 ,'Rub.',
'7 ',a*7 ,'Rub.',
'8 ',a*8 ,'Rub.',
'9 ',a*9 ,'Rub.',
'10',a*10, 'Rub.',
'11',a*11 ,'Rub.',
'12',a*12 ,'Rub.',
'13',a*13 ,'Rub.',
'14',a*14 ,'Rub.',
'15',a*15 ,'Rub.',
'16',a*16 ,'Rub.',
'17',a*17 ,'Rub.',
'18',a*18 ,'Rub.',
'19',a*19 ,'Rub.',
'20',a*20 ,'Rub.')
